In [2]:
import pandas as pd

In [3]:
frame = pd.DataFrame({"Numbers":range(10), "Chars":["a"]*10})

In [4]:
frame

  Chars  Numbers
0     a        0
1     a        1
2     a        2
3     a        3
4     a        4
5     a        5
6     a        6
7     a        7
8     a        8
9     a        9

In [5]:
frame = pd.read_csv("dataset.tsv", header = 0, sep = "\t")

In [6]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [8]:
frame.columns

Index([u'Name', u'Birth', u'City', u'Position'], dtype='object')

In [9]:
frame.shape

(6, 4)

In [12]:
new_attribute = {"Name": "Anar", "Birth": "05.03.1996","City": "Derbent", "Position": "Programm Developer"}

In [13]:
frame.append(new_attribute , ignore_index = True)

              Name       Birth       City            Position
0      Иванов А.А.  22.03.1980     Москва                 NaN
1     Сорокин И.В.  07.08.1965  Волгоград             инженер
2       Белов М.М.  13.02.1980     Ростов            менеджер
3  Мельникова Д.С.  15.04.1985     Ростов                 NaN
4      Рыбина Е.П.  19.11.1985     Москва             инженер
5     Костров С.О.  31.05.1985     Москва              стажер
6             Anar  05.03.1996    Derbent  Programm Developer

In [14]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [18]:
frame = frame.append(new_attribute , ignore_index = True)

In [19]:
frame

              Name       Birth       City            Position
0      Иванов А.А.  22.03.1980     Москва                 NaN
1     Сорокин И.В.  07.08.1965  Волгоград             инженер
2       Белов М.М.  13.02.1980     Ростов            менеджер
3  Мельникова Д.С.  15.04.1985     Ростов                 NaN
4      Рыбина Е.П.  19.11.1985     Москва             инженер
5     Костров С.О.  31.05.1985     Москва              стажер
6             Anar  05.03.1996    Derbent  Programm Developer

In [21]:
frame["isStudent"] = ["Yes"]*2 + ["No"]*4 + ["Yes"]

In [22]:
frame

              Name       Birth       City            Position isStudent
0      Иванов А.А.  22.03.1980     Москва                 NaN       Yes
1     Сорокин И.В.  07.08.1965  Волгоград             инженер       Yes
2       Белов М.М.  13.02.1980     Ростов            менеджер        No
3  Мельникова Д.С.  15.04.1985     Ростов                 NaN        No
4      Рыбина Е.П.  19.11.1985     Москва             инженер        No
5     Костров С.О.  31.05.1985     Москва              стажер        No
6             Anar  05.03.1996    Derbent  Programm Developer       Yes

In [23]:
frame.drop([4,5], axis = 0, inplace = True)

In [24]:
frame

              Name       Birth       City            Position isStudent
0      Иванов А.А.  22.03.1980     Москва                 NaN       Yes
1     Сорокин И.В.  07.08.1965  Волгоград             инженер       Yes
2       Белов М.М.  13.02.1980     Ростов            менеджер        No
3  Мельникова Д.С.  15.04.1985     Ростов                 NaN        No
6             Anar  05.03.1996    Derbent  Programm Developer       Yes

In [26]:
frame.drop(["isStudent"] , axis = 1 , inplace = True)

In [27]:
frame

              Name       Birth       City            Position
0      Иванов А.А.  22.03.1980     Москва                 NaN
1     Сорокин И.В.  07.08.1965  Волгоград             инженер
2       Белов М.М.  13.02.1980     Ростов            менеджер
3  Мельникова Д.С.  15.04.1985     Ростов                 NaN
6             Anar  05.03.1996    Derbent  Programm Developer

In [29]:
frame.to_csv("updated_dataset.csv", sep = "_" , header = True , index = None)

In [30]:
!cat updated_dataset.csv

Name_Birth_City_Position
Иванов А.А._22.03.1980_Москва_
Сорокин И.В._07.08.1965_Волгоград_инженер
Белов М.М._13.02.1980_Ростов_менеджер
Мельникова Д.С._15.04.1985_Ростов_
Anar_05.03.1996_Derbent_Programm Developer

In [37]:
frame = pd.read_csv("dataset.tsv", header = 0, sep = "\t")

In [39]:
frame.dtypes

Name        object
Birth       object
City        object
Position    object
dtype: object

In [40]:
frame.Birth = frame.Birth.apply(pd.to_datetime) # меняем формат с obj на datetime

In [41]:
frame.dtypes

Name                object
Birth       datetime64[ns]
City                object
Position            object
dtype: object

In [42]:
frame

              Name      Birth       City  Position
0      Иванов А.А. 1980-03-22     Москва       NaN
1     Сорокин И.В. 1965-07-08  Волгоград   инженер
2       Белов М.М. 1980-02-13     Ростов  менеджер
3  Мельникова Д.С. 1985-04-15     Ростов       NaN
4      Рыбина Е.П. 1985-11-19     Москва   инженер
5     Костров С.О. 1985-05-31     Москва    стажер

In [43]:
frame.info() # дает сводку по нашей таблице в целом

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
Name        6 non-null object
Birth       6 non-null datetime64[ns]
City        6 non-null object
Position    4 non-null object
dtypes: datetime64[ns](1), object(3)
memory usage: 264.0+ bytes

In [44]:
frame.fillna("разноробочий", inplace = True) #заполняет пустые поля в  таблице

In [45]:
frame

              Name      Birth       City      Position
0      Иванов А.А. 1980-03-22     Москва  разноробочий
1     Сорокин И.В. 1965-07-08  Волгоград       инженер
2       Белов М.М. 1980-02-13     Ростов      менеджер
3  Мельникова Д.С. 1985-04-15     Ростов  разноробочий
4      Рыбина Е.П. 1985-11-19     Москва       инженер
5     Костров С.О. 1985-05-31     Москва        стажер

In [47]:
frame.Position

0    разноробочий
1         инженер
2        менеджер
3    разноробочий
4         инженер
5          стажер
Name: Position, dtype: object

In [48]:
frame[["Position"]]

       Position
0  разноробочий
1       инженер
2      менеджер
3  разноробочий
4       инженер
5        стажер

In [49]:
frame[["Name","Position"]]

              Name      Position
0      Иванов А.А.  разноробочий
1     Сорокин И.В.       инженер
2       Белов М.М.      менеджер
3  Мельникова Д.С.  разноробочий
4      Рыбина Е.П.       инженер
5     Костров С.О.        стажер

In [50]:
frame.head(4)

              Name      Birth       City      Position
0      Иванов А.А. 1980-03-22     Москва  разноробочий
1     Сорокин И.В. 1965-07-08  Волгоград       инженер
2       Белов М.М. 1980-02-13     Ростов      менеджер
3  Мельникова Д.С. 1985-04-15     Ростов  разноробочий

In [51]:
frame[:3]

           Name      Birth       City      Position
0   Иванов А.А. 1980-03-22     Москва  разноробочий
1  Сорокин И.В. 1965-07-08  Волгоград       инженер
2    Белов М.М. 1980-02-13     Ростов      менеджер

In [52]:
frame[-3:]

              Name      Birth    City      Position
3  Мельникова Д.С. 1985-04-15  Ростов  разноробочий
4      Рыбина Е.П. 1985-11-19  Москва       инженер
5     Костров С.О. 1985-05-31  Москва        стажер

In [55]:
frame.loc[[1,5,2] ,["Name", "Birth"]]

           Name      Birth
1  Сорокин И.В. 1965-07-08
5  Костров С.О. 1985-05-31
2    Белов М.М. 1980-02-13

In [56]:
frame.iloc[[1,3,5], [0,2,3]]

              Name       City      Position
1     Сорокин И.В.  Волгоград       инженер
3  Мельникова Д.С.     Ростов  разноробочий
5     Костров С.О.     Москва        стажер

In [57]:
frame.ix[[1,5],["Name", "City"]]

           Name       City
1  Сорокин И.В.  Волгоград
5  Костров С.О.     Москва

In [58]:
frame.ix[[1,5],[0,2,3]]

           Name       City Position
1  Сорокин И.В.  Волгоград  инженер
5  Костров С.О.     Москва   стажер

In [59]:
frame[frame.Birth >= pd.datetime(1985,1,1)] # выборка по дате (сортировка)

              Name      Birth    City      Position
3  Мельникова Д.С. 1985-04-15  Ростов  разноробочий
4      Рыбина Е.П. 1985-11-19  Москва       инженер
5     Костров С.О. 1985-05-31  Москва        стажер

In [60]:
frame[(frame.Birth >= pd.datetime(1985,1,1)) & (frame.City != "Москва")]

              Name      Birth    City      Position
3  Мельникова Д.С. 1985-04-15  Ростов  разноробочий

In [69]:
frame[(frame.Birth >= pd.datetime(1985,1,1)) | (frame.City == "Волгоград")]

              Name      Birth       City      Position
1     Сорокин И.В. 1965-07-08  Волгоград       инженер
3  Мельникова Д.С. 1985-04-15     Ростов  разноробочий
4      Рыбина Е.П. 1985-11-19     Москва       инженер
5     Костров С.О. 1985-05-31     Москва        стажер